Revit 2024 API
Zone.Volume Property
Get the Volume of the Zone.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double Volume { get; }
Visual Basic
Public ReadOnly Property Volume As Double
	Get
Visual C++
public:
property double Volume {
	double get ();
}
Remarks
This property is used to get the Volume of the Zone.
See Also
Zone Class
Autodesk.Revit.DB.Mechanical Namespace